---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRailType.StartOrBottomTermination
source: html/45b39093-e7bd-b422-a70f-ea63fa6e7634.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRailType.StartOrBottomTermination Property

The termination of the rail at the beginning or bottom.

## Syntax (C#)
```csharp
public ElementId StartOrBottomTermination { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The termination is not a valid termination symbol for continuous rail.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null